oct23/pokedex_app/app/controllers/pokemons_controller.rb

INSERT INTO "pokemons" ("species", "nickname", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["species", "cat"], ["nickname", "ginger"], ["level", 1], ["created_at", "2017-10-22 23:20:05.659540"], ["updated_at", "2017-10-22 23:20:05.659540"]]
---
  def create
    pokemon = Pokemon.new
    pokemon.species = params[:species]
    pokemon.nickname = params[:nickname]
    pokemon.level = params[:level]
    pokemon.save

SELECT "pokemons".* FROM "pokemons"
---
  def index
    @pokemons = Pokemon.all